#include <iostream>;
using namespace std;

int main()
{
  cout << "     _      _____   ____    ___            ____                       " << endl;
  cout << "    / \    |_   _| |  _ \  |_ _|          / ___|   ___    _ __    ___ " << endl;
  cout << "   / _ \     | |   | |_) |  | |   _____  | |      / _ \  | '__|  / _ \" << endl;
  cout << "  / ___ \    | |   |  _ <   | |  |_____| | |___  | (_) | | |    |  __/" << endl;
  cout << " /_/   \_\   |_|   |_| \_\ |___|          \____|  \___/  |_|     \___|" << endl;
  cout << endl;
  cout << "等待完善本部分代码...非常抱歉，因为我还在学习它";
  return 0;
}
